Revit 2027 API
FootPrintRoof.ExtendIntoWall Property
Retrieve or set whether extend into wall the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool this[
	ModelCurve pCurve
] { get; set; }
Public Property ExtendIntoWall (
	pCurve As ModelCurve
) As Boolean
	Get
	Set
public:
property bool ExtendIntoWall[ModelCurve^ pCurve] {
	bool get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, bool value);
}
member ExtendIntoWall : bool with get, set
Parameters
pCurve ModelCurve
Property Value
Boolean
Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace